In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.1
1.19.2

# Task 1

Pirson - Spirman

# Task 2

Kramer and Means

# Task 3

Means

# Task 4

data = pd.read_csv('illiteracy.txt',sep='\t')
data.head()

# Task 5

In [19]:
data = pd.read_csv('illiteracy.txt',delimiter='\t')
data.head()

   Country  Illit  Births
0  Albania   20.5    1.78
1  Algeria   39.1    2.44
2  Bahrain   15.0    2.34
3   Belize    5.9    2.97
4    Benin   73.5    5.60

In [7]:
data.corr()

           Illit    Births
Illit   1.000000  0.768663
Births  0.768663  1.000000

In [12]:
data.corr(method='spearman',)

           Illit    Births
Illit   1.000000  0.752962
Births  0.752962  1.000000

In [33]:
data[['Illit']].corrwith(data[['Births']], axis=0)

Births   NaN
Illit    NaN
dtype: float64